In [33]:
import sqlite3
import pandas as pd

In [34]:
#Connect to database
conn = sqlite3.connect('LibraryDatabase.db')
cursor = conn.cursor()

In [35]:
#Insert sample data into Users table
cursor.execute("INSERT INTO Users (id, full_name, enabled, last_login) VALUES (1, 'John Smith', 'f', '2017-10-25 10:26:10.015152')")
cursor.execute("INSERT INTO Users (id, full_name, enabled, last_login) VALUES (2, 'Alice Walker', 't', '2017-10-25 10:26:50.249461')")
cursor.execute("INSERT INTO Users (id, full_name, enabled, last_login) VALUES (3, 'Harry Potter', 't', '2017-10-25 10:26:50.249461')")
cursor.execute("INSERT INTO Users (id, full_name, enabled, last_login) VALUES (4, 'Jane Smith', 't', '2017-10-25 10:36:43.324015')")

In [36]:
#Insert sample data into Addresses table
cursor.execute("INSERT INTO Addresses (user_id, user_id, street, city, state) VALUES (1, 1, '1 Market Street', 'San Francisco', 'CA')")
cursor.execute("INSERT INTO Addresses (user_id, user_id, street, city, state) VALUES (2, 2, '2 Elm Street', 'San Francisco', 'CA')")
cursor.execute("INSERT INTO Addresses (user_id, user_id, street, city, state) VALUES (3, 3, '3 Main Street', 'Boston', 'MA')")

In [37]:
#Insert sample data into Books table
cursor.execute("INSERT INTO Books (id, title, author, published_date, isbn) VALUES (1, 'My First SQL book', 'Mary Parker', '2012-02-22 12:08:17.320053-03', '981483029127')")
cursor.execute("INSERT INTO Books (id, title, author, published_date, isbn) VALUES (2, 'My Second SQL book', 'John Mayer', '1972-07-03 09:22:45.050088-07', '857300023713')")
cursor.execute("INSERT INTO Books (id, title, author, published_date, isbn) VALUES (3, 'My Third SQL book', 'Cary Flint', '2015-10-18 14:05:44.547516-07', '523120967812')")

In [38]:
#Insert sample data into Reviews table
cursor.execute("INSERT INTO Reviews (id, book_id, reviewer_name, content, rating, published_date) VALUES (1, 1, 'John Smith', 'My first review', 4, '2017-12-10 05:50:11.127281-02')")
cursor.execute("INSERT INTO Reviews (id, book_id, reviewer_name, content, rating, published_date) VALUES (2, 2, 'John Smith', 'My second review', 5, '2017-10-13 15:05:12.673382-05')")
cursor.execute("INSERT INTO Reviews (id, book_id, reviewer_name, content, rating, published_date) VALUES (3, 2, 'Alice Walker', 'Another review', 1, '2017-10-22 23:47:10.407569-07')")

In [39]:
#Insert sample data into Checkouts table
cursor.execute("INSERT INTO Checkouts (id, user_id, book_id, checkout_date, return_date) VALUES (1, 1, 1, '2017-10-15 14:43:18.095143-07', NULL)")
cursor.execute("INSERT INTO Checkouts (id, user_id, book_id, checkout_date, return_date) VALUES (2, 1, 2, '2017-10-05 16:22:44.593188-07', '2017-10-13 13:05:12.673382-05')")
cursor.execute("INSERT INTO Checkouts (id, user_id, book_id, checkout_date, return_date) VALUES (3, 2, 2, '2017-10-15 11:11:24.994973-07', '2017-10-22 17:47:10.407569-07')")
cursor.execute("INSERT INTO Checkouts (id, user_id, book_id, checkout_date, return_date) VALUES (4, 5, 3, '2017-10-15 09:27:07.215217-07', NULL)")

In [40]:
#checking users table
query_users = '''
SELECT * FROM Users
'''
cursor.execute(query_users)
results_users = cursor.fetchall()
for row in results_users:
    print(row)

(1, 'John Smith', 'f', '2017-10-25 10:26:10.015152')
(2, 'Alice Walker', 't', '2017-10-25 10:26:50.249461')
(3, 'Harry Potter', 't', '2017-10-25 10:26:50.249461')
(4, 'Jane Smith', 't', '2017-10-25 10:36:43.324015')

In [41]:
#checking Books table
query_books = '''
SELECT * FROM Books
'''
cursor.execute(query_books)
results_books = cursor.fetchall()
for row in results_books:
    print(row)

(1, 'My First SQL book', 'Mary Parker', '2012-02-22 12:08:17.320053-03', '981483029127')
(2, 'My Second SQL book', 'John Mayer', '1972-07-03 09:22:45.050088-07', '857300023713')
(3, 'My Third SQL book', 'Cary Flint', '2015-10-18 14:05:44.547516-07', '523120967812')

In [42]:
#checking Checkouts table
query_checkouts = '''
SELECT * FROM Checkouts
'''
cursor.execute(query_checkouts)
results_checkouts = cursor.fetchall()
for row in results_checkouts:
    print(row)

(1, 1, 1, '2017-10-15 14:43:18.095143-07', None)
(2, 1, 2, '2017-10-05 16:22:44.593188-07', '2017-10-13 13:05:12.673382-05')
(3, 2, 2, '2017-10-15 11:11:24.994973-07', '2017-10-22 17:47:10.407569-07')
(4, 5, 3, '2017-10-15 09:27:07.215217-07', None)

In [43]:
#checking Addresses table
query_addresses = '''
SELECT * FROM Addresses
'''
cursor.execute(query_addresses)
results_addresses = cursor.fetchall()
for row in results_addresses:
    print(row)

(1, '1 Market Street', 'San Francisco', 'CA')
(2, '2 Elm Street', 'San Francisco', 'CA')
(3, '3 Main Street', 'Boston', 'MA')

In [44]:
#checking Reviews table
query_reviews = '''
SELECT * FROM Reviews
'''
cursor.execute(query_reviews)
results_reviews = cursor.fetchall()
for row in results_reviews:
    print(row)

(1, 1, 'John Smith', 'My first review', 4, '2017-12-10 05:50:11.127281-02')
(2, 2, 'John Smith', 'My second review', 5, '2017-10-13 15:05:12.673382-05')
(3, 2, 'Alice Walker', 'Another review', 1, '2017-10-22 23:47:10.407569-07')

In [45]:
conn.commit()
conn.close()